---
kind: type
id: T:Autodesk.Revit.Exceptions.FileNotFoundException
source: html/73250198-dbc6-e760-4297-ec062f00f574.htm
---
# Autodesk.Revit.Exceptions.FileNotFoundException

The exception that is thrown when the specified file could not be found.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class FileNotFoundException : IOException
```